#+TITLE: README
#+PROPERTY: header-args:sh :prologue "exec 2>&1" :epilogue ":"
* Show Packages
#+begin_src sh :async t :exports both :results code
nix flake show
#+end_src

#+RESULTS:
#+begin_src sh
[1mgit+file:///home/gtrun/src/threatbus-nix-flake?ref=main&rev=61f651f19235e8dbbda219993abdb3352af0ff0e[0m
[32;1mâ”œâ”€â”€â”€[0m[1mapps[0m
[32;1mâ”‚   â”œâ”€â”€â”€[0m[1mx86_64-darwin[0m
[32;1mâ”‚   â”‚   â”œâ”€â”€â”€[0m[1mthreatbus[0m: app
[32;1mâ”‚   â”‚   â””â”€â”€â”€[0m[1mthreatbus-pyvast[0m: app
[32;1mâ”‚   â””â”€â”€â”€[0m[1mx86_64-linux[0m
[32;1mâ”‚       â”œâ”€â”€â”€[0m[1mthreatbus[0m: app
[32;1mâ”‚       â””â”€â”€â”€[0m[1mthreatbus-pyvast[0m: app
[32;1mâ”œâ”€â”€â”€[0m[1mdefaultPackage[0m
[32;1mâ”‚   â”œâ”€â”€â”€[0m[1mx86_64-darwin[0m: package 'python3.8-threatbus-2021.3.25'
[32;1mâ”‚   â””â”€â”€â”€[0m[1mx86_64-linux[0m: package 'python3.8-threatbus-2021.3.25'
[32;1mâ”œâ”€â”€â”€[0m[1mdevShell[0m
[32;1mâ”‚   â”œâ”€â”€â”€[0m[1mx86_64-darwin[0m: development environment 'devshell'
[32;1mâ”‚   â””â”€â”€â”€[0m[1mx86_64-linux[0m: development environment 'devshell'
[32;1mâ”œâ”€â”€â”€[0m[1mhydraJobs[0m
[32;1mâ”‚   â”œâ”€â”€â”€[0m[1mx86_64-darwin[0m
[32;1mâ”‚   â”‚   â””â”€â”€â”€[0m[1mpackages[0m
[32;1mâ”‚   â”‚       â”œâ”€â”€â”€[0m[1mbroker[0m: derivation 'broker'
[32;1mâ”‚   â”‚       â”œâ”€â”€â”€[0m[1mthreatbus[0m: derivation 'python3.8-threatbus-2021.3.25'
[32;1mâ”‚   â”‚       â”œâ”€â”€â”€[0m[1mthreatbus-pyvast[0m: derivation 'python3.8-threatbus_pyvast-2021.3.25'
[32;1mâ”‚   â”‚       â””â”€â”€â”€[0m[1mvast[0m: derivation 'vast-2021.03.25-rc2-46-gf427936fd-dirty'
[32;1mâ”‚   â””â”€â”€â”€[0m[1mx86_64-linux[0m
[32;1mâ”‚       â””â”€â”€â”€[0m[1mpackages[0m
[32;1mâ”‚           â”œâ”€â”€â”€[0m[1mbroker[0m: derivation 'broker'
[32;1mâ”‚           â”œâ”€â”€â”€[0m[1mthreatbus[0m: derivation 'python3.8-threatbus-2021.3.25'
[32;1mâ”‚           â”œâ”€â”€â”€[0m[1mthreatbus-pyvast[0m: derivation 'python3.8-threatbus_pyvast-2021.3.25'
[32;1mâ”‚           â””â”€â”€â”€[0m[1mvast[0m: derivation 'vast-2021.03.25-rc2-46-gf427936fd-dirty'
[32;1mâ”œâ”€â”€â”€[0m[1mnixosModules[0m
[32;1mâ”‚   â”œâ”€â”€â”€[0m[1mthreatbus[0m: NixOS module
[32;1mâ”‚   â””â”€â”€â”€[0m[1mthreatbus-vast[0m: NixOS module
[32;1mâ”œâ”€â”€â”€[0m[1moverlay[0m: Nixpkgs overlay
[32;1mâ””â”€â”€â”€[0m[1mpackages[0m
[32;1m    â”œâ”€â”€â”€[0m[1mx86_64-darwin[0m
[32;1m    â”‚   â”œâ”€â”€â”€[0m[1mbroker[0m: package 'broker'
[32;1m    â”‚   â”œâ”€â”€â”€[0m[1mthreatbus[0m: package 'python3.8-threatbus-2021.3.25'
[32;1m    â”‚   â”œâ”€â”€â”€[0m[1mthreatbus-pyvast[0m: package 'python3.8-threatbus_pyvast-2021.3.25'
[32;1m    â”‚   â””â”€â”€â”€[0m[1mvast[0m: package 'vast-2021.03.25-rc2-46-gf427936fd-dirty'
[32;1m    â””â”€â”€â”€[0m[1mx86_64-linux[0m
[32;1m        â”œâ”€â”€â”€[0m[1mbroker[0m: package 'broker'
[32;1m        â”œâ”€â”€â”€[0m[1mthreatbus[0m: package 'python3.8-threatbus-2021.3.25'
[32;1m        â”œâ”€â”€â”€[0m[1mthreatbus-pyvast[0m: package 'python3.8-threatbus_pyvast-2021.3.25'
[32;1m        â””â”€â”€â”€[0m[1mvast[0m: package 'vast-2021.03.25-rc2-46-gf427936fd-dirty'
#+end_src

* Build Example

#+begin_src sh :async t :exports both :results output
nix build github:GTrunSec/GTrunSec/threatbus-nix-flake#<PACKAGE_NAME>
#+end_src

#+begin_src sh :async t :exports both :results output
nix build github:GTrunSec/GTrunSec/threatbus-nix-flake#threatbus
#+end_src

* Add Nixos Modules Flake to NixOS

#+begin_src nix :async t :exports both :results output
threatbus-flake.nixosModules.threatbus
threatbus-flake.nixosModules.threatbus-vast
#+end_src

- Example Module Settings

#+begin_src nix :async t :exports both :results output
  services.threatbus-vast = {
    enable = true;
    settings = builtins.readFile ./config.vast.example.yaml;
  };

  services.threatbus = {
    enable = true;
    settings = builtins.readFile ./config.example.yaml;
  };
#+end_src

* ThreatBus Systemd Services Debugging

- Threatbus-vast

#+begin_src sh :async t :exports both :results output
systemctl status threatbus-vast.service
#+end_src

#+RESULTS:
#+begin_example
â— threatbus-vast.service - Vast::The missing link to connect open-source threat intelligence tools.
     Loaded: loaded (/nix/store/jiqi9prhydz3kbg3nj0i95yn48mbxinf-unit-threatbus-vast.service/threatbus-vast.service; enabled; vendor preset: enabled)
     Active: active (running) since Tue 2021-04-06 15:56:46 PDT; 48min ago
   Main PID: 2634 (.pyvast-threatb)
         IP: 394.8K in, 486.4K out
         IO: 12.3M read, 4.0K written
      Tasks: 3 (limit: 4915)
     Memory: 38.5M
        CPU: 11.126s
     CGroup: /system.slice/threatbus-vast.service
             â””â”€2634 /nix/store/v3bj7jrns4sk6yj2rp30p6v2l7p707az-python3-3.8.8/bin/python3.8 /nix/store/cn6yl8blwkqqssaa6n1508m3mmaqzq1r-python3.8-threatbus_pyvast-2021.3.25/bin/.pyvast-threatbus-wrapped --config=/nix/store/9axvi3icnagklxpc00q4axya0x49qbs3-config.yml

Apr 06 15:56:46 NixOS systemd[1]: Started Vast::The missing link to connect open-source threat intelligence tools..
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 DEBUG    [pyvast-threatbus] PyVAST: VAST client configured to use endpoint 127.0.0.1:4000
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 DEBUG    [pyvast-threatbus] Calling Threat Bus management endpoint 127.0.0.1:13370
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 INFO     [pyvast-threatbus] Subscribing to topic 'stix2/indicator'...
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 INFO     [pyvast-threatbus] Subscription successful. New p2p_topic: zpbgwmleporxjonsethjnsbappdkofjp
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 INFO     [pyvast-threatbus] Using 'fever alertify --alert-prefix 'MY PREFIX' --extra-key my-ioc --ioc %ioc' to transform every sighting's context before sending
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 INFO     [pyvast-threatbus] Forwarding sightings to sink 'STDOUT'
Apr 06 15:56:47 NixOS threatbus-vast[2634]: 2021-04-06 15:56:47 INFO     [pyvast-threatbus] Receiving via ZMQ on topic 127.0.0.1:13371/zpbgwmleporxjonsethjnsbappdkofjp
#+end_example

- threatbus

#+begin_src sh :async t :exports both :results output
systemctl status threatbus.service
#+end_src

#+RESULTS:
#+begin_example
â— threatbus.service - The missing link to connect open-source threat intelligence tools.
     Loaded: loaded (/nix/store/dkb1dkxsn9skqhlcddi5a8h8nlf9sgdf-unit-threatbus.service/threatbus.service; enabled; vendor preset: enabled)
     Active: active (running) since Tue 2021-04-06 15:56:46 PDT; 48min ago
   Main PID: 2632 (.threatbus-wrap)
         IP: 483.7K in, 391.9K out
         IO: 16.4M read, 0B written
      Tasks: 34 (limit: 4915)
     Memory: 44.1M
        CPU: 2min 56.334s
     CGroup: /system.slice/threatbus.service
             â””â”€2632 /nix/store/v3bj7jrns4sk6yj2rp30p6v2l7p707az-python3-3.8.8/bin/python3.8 /nix/store/6jqkqml5hpgcm5iknifmbbjq6h6gvgyz-python3.8-threatbus-2021.3.25/bin/.threatbus-wrapped --config=/nix/store/bchy3qlc3rp11hbsbn22l4i9dzrwjsly-config.yml

Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus] Disabling installed, but unconfigured backbones 'inmem'
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus] Disabling installed, but unconfigured backbones 'file_benchmark'
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 WARNING  [threatbus] Found configuration for 'cif3' but no corresponding plugin is installed.
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 WARNING  [threatbus] Found configuration for 'rabbitmq' but no corresponding plugin is installed.
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 WARNING  [threatbus] Found configuration for 'misp' but no corresponding plugin is installed.
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus] Starting plugins...
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus_zmq_app.plugin] ZeroMQ app plugin started
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus_zeek.plugin] Zeek plugin started
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus_zmq_app.plugin] Received subscription for topic stix2/indicator, snapshot 30 days, 0:00:00
Apr 06 15:56:47 NixOS threatbus[2632]: 2021-04-06 15:56:47 INFO     [threatbus] Requesting snapshot from all plugins for message type INDICATOR and time delta 30 days, 0:00:00
#+end_example


- Vast

#+begin_src sh :async t :exports both :results output
systemctl status vast.service
#+end_src

#+RESULTS:
#+begin_example
â— vast.service - Visibility Across Space and Time
     Loaded: loaded (/nix/store/jnzs0h4ymhhmkhd9k0jccd86yj60yks2-vast-chroot-paths/lib/systemd/system/vast.service; enabled; vendor preset: enabled)
    Drop-In: /nix/store/78458q75v1j6psakfsbzzbb25vq8d8fc-system-units/vast.service.d
             â””â”€overrides.conf
     Active: active (running) since Tue 2021-04-06 15:56:46 PDT; 48min ago
   Main PID: 2633 (vast)
         IP: 1.9K in, 2.2K out
         IO: 32.1M read, 56.0K written
      Tasks: 21 (limit: 4915)
     Memory: 431.7M
        CPU: 2min 30.887s
     CGroup: /system.slice/vast.service
             â””â”€2633 /nix/store/b1lvwgbhk6ab9ja36b838mg64v8a97j8-vast-2021.03.25-rc2-46-gf427936fd-dirty/bin/vast --config=/nix/store/bx9ncl6awridvamivf5m1nvr3jbwm3r8-vast.conf start

Apr 06 15:56:46 NixOS systemd[1]: Started Visibility Across Space and Time.
Apr 06 15:56:46 NixOS vast[2633]: [22:56:46.895] loaded configuration file: "/nix/store/bx9ncl6awridvamivf5m1nvr3jbwm3r8-vast.conf"
Apr 06 15:56:46 NixOS vast[2633]: [22:56:46.940] VAST node is listening on 127.0.0.1:4000
#+end_example
